testclient.txt

<s:Envelope xmlns:s="http://www.w3.org/2003/05/soap-envelope" xmlns:a="http://www.w3.org/2005/08/addressing"><s:Header><a:Action s:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2005/02/trust/RST/Issue</a:Action><a:MessageID>urn:uuid:a1164319-5897-41ff-b672-5b628e5a8189</a:MessageID><a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo><a:To s:mustUnderstand="1">http://localhost.fiddler:4321/TestService</a:To></s:Header><s:Body><t:RequestSecurityToken Context="uuid-873e11d8-1e6e-48af-b0fb-3c86b9199fe8-1" xmlns:t="http://schemas.xmlsoap.org/ws/2005/02/trust"><t:TokenType>http://schemas.xmlsoap.org/ws/2005/02/sc/sct</t:TokenType><t:RequestType>http://schemas.xmlsoap.org/ws/2005/02/trust/Issue</t:RequestType><t:KeySize>256</t:KeySize><t:BinaryExchange ValueType="http://schemas.xmlsoap.org/ws/2005/02/trust/spnego" EncodingType="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-soap-message-security-1.0#Base64Binary">YIGTBgYrBgEFBQKggYgwgYWgMDAuBgkqhkiC9xIBAgIGCSqGSIb3EgECAgYKKwYBBAGCNwICHgYKKwYBBAGCNwICCqJRBE9gTQYKKoZIhvcSAQICAwQAMD2gAwIBBaEDAgEQohkwF6ADAgEBoRAwDhsMbS5zY2hlZHJpdml5oxYbFG9mZmljZWtpZXYuZm96enkubGFu</t:BinaryExchange></t:RequestSecurityToken></s:Body></s:Envelope>
